### Terraform Result 📝️ `test-terratest`
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙ ️`success`
#### Terraform Validation 🤖

```
Success! The configuration is valid.


```

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database_instance.main will be created
  + resource "google_sql_database_instance" "main" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_8_0"
      + deletion_protection           = false
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = jsonencode(
            {
              + auth_provider_x509_cert_url = "https://www.googleapis.com/oauth2/v1/certs"
              + auth_uri                    = "https://accounts.google.com/o/oauth2/auth"
              + client_email                = "github-terratest@test-terraform-project-01.iam.gserviceaccount.com"
              + client_id                   = "110646922973163539829"
              + client_x509_cert_url        = "https://www.googleapis.com/robot/v1/metadata/x509/github-terratest%40test-terraform-project-01.iam.gserviceaccount.com"
              + private_key                 = <<-EOT
                    -----BEGIN PRIVATE KEY-----
                    MIIEuwIBADANBgkqhkiG9w0BAQEFAASCBKUwggShAgEAAoIBAQDqfRVKJ9fdSYQB
                    tXJoTkziHOFPFClRLgMWEB5I1odtRKnSu5S9dYq4fpG2MhGNGm5J1jGIe1bGge9B
                    wMybZ4V3rGokplAO/5QTIBPeeO+o+t9xFAsH5ccRtW872aXa2hpdj8Zobi+jQBJU
                    KNTcdZsqAkvCZpF5pKL3qwEBVcYeLfZkhXafQtf0XUFyFSSRxiFw8JgqLsrv8F0+
                    F9nWgZuxGTqKt9zbRUcH6yWL8AjbwfBbgfTt+yXN4RFkfHF1SZS7yG6IzxXx/1zL
                    g9srd/SyL09By6FkLaC+ZpXimeo5xMyDaGTCyDQRlsu89SbABpLTYjrFe3AHwjGf
                    jJ1NpPxNAgMBAAECggEAAbFmf8hlhsD69YIzBxgYS6z2tCSf9GiXIsfPWCpIWbHH
                    DMZIRCKUSPxiSUT3myOyNnvtPqAurQnkyX4+sUPgPaVz3LuLVMMOoCFj/gAJ3EKi
                    GLBoMKXoN94DUBTPCD35Nmy30NWJfYMUaXbOq/V4vycQwfYN8yliTdR2Z4/leXP1
                    oOosGyB0UuO1RrNrWkp1+SoP8BpF8kTsV+5BdHWTMG6Et9ZuwsfBXLjjbVvPRxnm
                    5Yjc29N1PB7iPl0MbevaGV2P8ASNpyG7FoD6eFY0CgWa+PfKE3SFdLxduNwplr8w
                    GZdIBL/Dz679QUhgHd4YuNA4lBPXavCZqYJdKgsnMQKBgQD1PqaDKgOuj98ljtay
                    CWz21fiRbbHEWnRAT9TEWBbuwFDDXObybwhr7Ig4lBIH1PrTuFzrukkNvpWz9pR2
                    DkqTFdbJ6wF1USw2w3TlUpetcUpxuvMHmiBAyib7H3IKWM+DK1Zxv3F86qc4Qx+H
                    SuvMaAckJms/TgRrREdWFaltmQKBgQD0xayfnbOZ7BhN+5MuP5b42kAzAxHIs9p2
                    dgIhpBe6AxDiHIL0C9WfEG4dzF20bZFHrxZlQZdetmkD2Cbar5z6URgpwg6628U7
                    ue7ffoUAKnP45kmQMFhyTOTp5tYdmxrhlbjjweaCEX4U/zglUosU6xIygOYVEhnJ
                    Ls0qJJqs1QKBgQDAd2ekno9/KsgcqKoT1VPfr/NA5s7RY4/CfSRk5yEwRFvdxoY1
                    EzCPynTpukMgRGSJTjIWif8VO1Ivhz/iGrsqDcSgeL+PO6IwZFrUMmp5IuUitm5O
                    tAXF8yB+iqIsPqC0t4lDAdTmDR4pCHyw5/qAU8/u7fvTFb5gFJjLlXp/WQKBgBL0
                    V8jIeob53Gv1hlE3hWZh6ETLAQ6MtucjfkjCnz+9SwpncNCbNgCqUgymrb7yGST2
                    7wIKUUF5WKp+i4u1u686pmddaqyXpi9Y16Gg94Wqw+5LTvkGdWLsh3GBeaUzRKKh
                    aH7ingoGdsADf4KMYM7O4Urd5nNNQofswuB3ky69An8KLirQcPFieAvhFVTni2Sj
                    xK6s8wZJNd5oYtVJXr9bfMDUtYcThiJDMUFpKR1Zgmnl0bo5Yz2R56/MYMhioU6A
                    7LGOR6xKm4YKNZaiCa7Tk+sJIesDomBf/4uimiNmf62G7k4y6OUPmKeRZ0E4rzxs
                    fVzvvw9fMtgrS0y0QXy0
                    -----END PRIVATE KEY-----
                EOT
              + private_key_id              = "89978929a92200ad432b68c059d85638d44baf82"
              + project_id                  = "test-terraform-project-01"
              + token_uri                   = "https://oauth2.googleapis.com/token"
              + type                        = "service_account"
            }
        )
      + public_ip_address             = (known after apply)
      + region                        = "asia-southeast2"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled = true
              + require_ssl  = true
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # random_id.instance_suffix will be created
  + resource "random_id" "instance_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_suffix                                            = (known after apply)
  + sql_database_instance_master_connection_name               = (known after apply)
  + sql_database_instance_master_first_ip_address              = (known after apply)
  + sql_database_instance_master_instance_name                 = (known after apply)
  + sql_database_instance_master_private_ip_address            = (known after apply)
  + sql_database_instance_master_public_ip_address             = (known after apply)
  + sql_database_instance_master_self_link                     = (known after apply)
  + sql_database_instance_master_service_account_email_address = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @poom, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*